publish_html/2016/learnredux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>redux学习笔记</title>
<!-- 2016-03-31 四 08:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dany" />
<link/>
</head>
<body>
<div id="content">
<h1 class="title">redux学习笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">redux简介</a></li>
<li><a href="#sec-2">个人理解</a>
<ul>
<li><a href="#sec-2-1">要根据数据来渲染／显示</a></li>
<li><a href="#sec-2-2">dispatch 就是消息派发的地方</a></li>
<li><a href="#sec-2-3">action就是产生消息结构体的地方</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">redux简介</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">个人理解</h2>
<div class="outline-text-2" id="text-2">
<p>
redux也好，flux也罢，就是一个统一的消息处理的规则。
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">要根据数据来渲染／显示</h3>
<div class="outline-text-3" id="text-2-1">
<p>
比如有一个标签，标签里面显示什么文字，要根据与之绑定的数据来确认
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">dispatch 就是消息派发的地方</h3>
<div class="outline-text-3" id="text-2-2">
<p>
dispatch就是统一的消息派发的地方。这里一般来说会有一个的switch case的地方，来根据消息的类型派发到具体的处理函数中
</p>
<div class="org-src-container">

<pre class="src src-javascript">switch(message.type) {
CASE LOGIN: {
}
case BUY_ITEM: {
}
.....
}
</pre>
</div>
<p>
为了使这个switch case写的顺眼一些，redux做了一些封装 例如combineReducer，但是这个函数是容易把初学者搞晕的地方，还不如直接就用switch case来的直观一些
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">action就是产生消息结构体的地方</h3>
<div class="outline-text-3" id="text-2-3">
<p>
这里负责产生结构体这个工作，至于为什么要产生这个结构体，不是这里负责的，有可能是因为网络的数据到达了要产生结构体，也有可能是因为用户点击了某个按钮所以要产生结构体。
这里喝reducer其实是有关系的，因为这里产生的结构体要在reducer里面使用，所以reducer要理解这里产生的结构体的每一个字段的含义
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dany</p>
<p class="date">Created: 2016-03-31 四 08:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
